<h2>
    1023_設計一個陣列(一維或多維)來存放學生的成績資料
</h2>

<?php
// 只是要呈現陣列，占資源少，但不易維護。

$subject=['國文','英文','數學','地理','歷史'];
$judy=[95,64,70,90,84];
$amo=[88,78,54,81,71];
$john=[45,60,68,70,62];
$peter=[59,32,77,54,42];
$hebe=[71,62,80,62,64];

$avg=($judy[0]+$amo[0]+$john[0]+$peter[0]+$hebe[0])/5;

echo $avg;


// 以下呈現陣列的方式，比較容易計算，但比較占資源：
$students=
['judy'=>['國文'=>95,'英文'=>64,'數學'=>70,'地理'=>90,'歷史'=>84],
'amo'=>['國文'=>88,'英文'=>78,'數學'=>54,'地理'=>81,'歷史'=>71],
'john'=>['國文'=>45,'英文'=>60,'數學'=>68,'地理'=>70,'歷史'=>62],
'peter'=>['國文'=>59,'英文'=>32,'數學'=>77,'地理'=>54,'歷史'=>42],
'hebe'=>['國文'=>71,'英文'=>62,'數學'=>80,'地理'=>62,'歷史'=>64],
];

print_r ($students);



?>